app/Http/Controllers/CategoriesController.php

    public function show(Category $category)
    {
        // 读取分类 ID 关联的话题，并按每 20 条分页
        $topics = Topic::with('user', 'category')->where('category_id', $category->id)->paginate(20);
---
select * from `categories` where `categories`.`id` in ('1')
select * from `topics` where `category_id` = '1' limit 20 offset 0
select * from `users` where `users`.`id` in ('2', '3', '4', '5', '6', '7', '8', '9', '10')
select count(*) as aggregate from `topics` where `category_id` = '1'